wright0418/Richlink_Smart_Box-M482S-/SampleCode/Smart_Box/modbus_rtu/modbus_rtu_client.c
#include "modbus_rtu_client.h"
#include "../led_indicator.h"

#include <string.h>

#include "M480.h"
#include "modbus_crc.h"
#include "modbus_rtu_protocol.h"

#define MODBUS_EXCEPTION_FUNCTION_FLAG (0x80U)

static uint32_t modbus_rtu_client_get_timestamp(const modbus_rtu_client_t *client)
{
    if ((client != NULL) && (client->config.timestamp_callback != NULL))
    {
        return client->config.timestamp_callback(client->config.timestamp_context);
    }
    return 0U;
}

static void modbus_rtu_client_prepare_for_request(modbus_rtu_client_t *client)
{
    client->state = MODBUS_RTU_CLIENT_STATE_WAITING;
    client->response_length = 0U;
    client->expected_length = 0U;
    client->exception_code = MODBUS_EXCEPTION_NONE;
    client->request_timestamp_us = modbus_rtu_client_get_timestamp(client);
    client->timing.last_byte_valid = false;
}

static bool modbus_rtu_client_send_frame(modbus_rtu_client_t *client, uint8_t *frame, uint16_t payload_length)
{
    modbus_crc16_append(frame, payload_length, client->config.crc_method);
    return client->config.tx_handler(frame, (uint16_t)(payload_length + 2U), client->config.tx_context);
}

bool modbus_rtu_client_init(modbus_rtu_client_t *client, const modbus_rtu_client_config_t *config)
{
    if ((client == NULL) || (config == NULL) || (config->tx_handler == NULL) || (config->baudrate == 0U))
    {
        return false;
    }

    memset(client, 0, sizeof(*client));
    client->config = *config;
    client->state = MODBUS_RTU_CLIENT_STATE_IDLE;

    if (client->config.crc_method == 0U)
    {
        client->config.crc_method = MODBUS_CRC_METHOD_AUTO;
    }

    modbus_timing_init(&client->timing, client->config.baudrate);
    return true;
}

void modbus_rtu_client_reset(modbus_rtu_client_t *client)
{
    if (client == NULL)
    {
        return;
    }

    client->state = MODBUS_RTU_CLIENT_STATE_IDLE;
    client->response_length = 0U;
    client->expected_length = 0U;
    client->exception_code = MODBUS_EXCEPTION_NONE;
    client->timeout_us = 0U;
    client->quantity = 0U;
    client->slave_address = 0U;
    client->write_value = 0U;
    modbus_timing_reset(&client->timing);
}

bool modbus_rtu_client_start_read_holding(modbus_rtu_client_t *client,
                                          uint8_t slave_address,
                                          uint16_t start_address,
                                          uint16_t quantity,
                                          uint32_t timeout_ms)
{
    if ((client == NULL) || (quantity == 0U) || (quantity > MODBUS_RTU_CLIENT_MAX_REGISTERS))
    {
        return false;
    }

    if ((client->state == MODBUS_RTU_CLIENT_STATE_WAITING) || (client->config.tx_handler == NULL))
    {
        return false;
    }

    uint8_t frame[MODBUS_RTU_MAX_ADU_LENGTH];
    frame[0] = slave_address;
    frame[1] = MODBUS_RTU_FUNCTION_READ_HOLDING;
    frame[2] = (uint8_t)((start_address >> 8) & 0xFFU);
    frame[3] = (uint8_t)(start_address & 0xFFU);
    frame[4] = (uint8_t)((quantity >> 8) & 0xFFU);
    frame[5] = (uint8_t)(quantity & 0xFFU);

    if (!modbus_rtu_client_send_frame(client, frame, 6U))
    {
        return false;
    }

    client->slave_address = slave_address;
    client->function_code = MODBUS_RTU_FUNCTION_READ_HOLDING;
    client->start_address = start_address;
    client->quantity = quantity;
    client->timeout_us = timeout_ms * 1000U;
    if (client->timeout_us == 0U)
    {
        client->timeout_us = 1000U;
    }

    client->write_value = 0U;

    modbus_timing_update(&client->timing, client->config.baudrate);
    modbus_timing_reset(&client->timing);
    modbus_rtu_client_prepare_for_request(client);
    return true;
}

bool modbus_rtu_client_start_read_coils(modbus_rtu_client_t *client,
                                        uint8_t slave_address,
                                        uint16_t start_address,
                                        uint16_t quantity,
                                        uint32_t timeout_ms)
{
    if ((client == NULL) || (quantity == 0U))
    {
        return false;
    }

    if ((client->state == MODBUS_RTU_CLIENT_STATE_WAITING) || (client->config.tx_handler == NULL))
    {
        return false;
    }

    uint8_t frame[MODBUS_RTU_MAX_ADU_LENGTH];
    frame[0] = slave_address;
    frame[1] = MODBUS_RTU_FUNCTION_READ_COILS;
    frame[2] = (uint8_t)((start_address >> 8) & 0xFFU);
    frame[3] = (uint8_t)(start_address & 0xFFU);
    frame[4] = (uint8_t)((quantity >> 8) & 0xFFU);
    frame[5] = (uint8_t)(quantity & 0xFFU);

    if (!modbus_rtu_client_send_frame(client, frame, 6U))
    {
        return false;
    }

    client->slave_address = slave_address;
    client->function_code = MODBUS_RTU_FUNCTION_READ_COILS;
    client->start_address = start_address;
    client->quantity = quantity;
    client->timeout_us = timeout_ms * 1000U;
    if (client->timeout_us == 0U)
    {
        client->timeout_us = 1000U;
    }

    client->write_value = 0U;

    modbus_timing_update(&client->timing, client->config.baudrate);
    modbus_timing_reset(&client->timing);
    modbus_rtu_client_prepare_for_request(client);
    return true;
}

bool modbus_rtu_client_start_read_discrete_inputs(modbus_rtu_client_t *client,
                                                  uint8_t slave_address,
                                                  uint16_t start_address,
                                                  uint16_t quantity,
                                                  uint32_t timeout_ms)
{
    if ((client == NULL) || (quantity == 0U))
    {
        return false;
    }

    if ((client->state == MODBUS_RTU_CLIENT_STATE_WAITING) || (client->config.tx_handler == NULL))
    {
        return false;
    }

    uint8_t frame[MODBUS_RTU_MAX_ADU_LENGTH];
    frame[0] = slave_address;
    frame[1] = MODBUS_RTU_FUNCTION_READ_DISCRETE_INPUTS;
    frame[2] = (uint8_t)((start_address >> 8) & 0xFFU);
    frame[3] = (uint8_t)(start_address & 0xFFU);
    frame[4] = (uint8_t)((quantity >> 8) & 0xFFU);
    frame[5] = (uint8_t)(quantity & 0xFFU);

    if (!modbus_rtu_client_send_frame(client, frame, 6U))
    {
        return false;
    }

    client->slave_address = slave_address;
    client->function_code = MODBUS_RTU_FUNCTION_READ_DISCRETE_INPUTS;
    client->start_address = start_address;
    client->quantity = quantity;
    client->timeout_us = timeout_ms * 1000U;
    if (client->timeout_us == 0U)
    {
        client->timeout_us = 1000U;
    }

    client->write_value = 0U;

    modbus_timing_update(&client->timing, client->config.baudrate);
    modbus_timing_reset(&client->timing);
    modbus_rtu_client_prepare_for_request(client);
    return true;
}

