wright0418/Richlink_Smart_Box-M482S-/SampleCode/Smart_Box/modbus_rtu/modbus_rtu_client.c
bool modbus_rtu_client_start_read_input(modbus_rtu_client_t *client,
                                        uint8_t slave_address,
                                        uint16_t start_address,
                                        uint16_t quantity,
                                        uint32_t timeout_ms)
{
    if ((client == NULL) || (quantity == 0U) || (quantity > MODBUS_RTU_CLIENT_MAX_REGISTERS))
    {
        return false;
    }

    if ((client->state == MODBUS_RTU_CLIENT_STATE_WAITING) || (client->config.tx_handler == NULL))
    {
        return false;
    }

    uint8_t frame[MODBUS_RTU_MAX_ADU_LENGTH];
    frame[0] = slave_address;
    frame[1] = MODBUS_RTU_FUNCTION_READ_INPUT;
    frame[2] = (uint8_t)((start_address >> 8) & 0xFFU);
    frame[3] = (uint8_t)(start_address & 0xFFU);
    frame[4] = (uint8_t)((quantity >> 8) & 0xFFU);
    frame[5] = (uint8_t)(quantity & 0xFFU);

    if (!modbus_rtu_client_send_frame(client, frame, 6U))
    {
        return false;
    }

    client->slave_address = slave_address;
    client->function_code = MODBUS_RTU_FUNCTION_READ_INPUT;
    client->start_address = start_address;
    client->quantity = quantity;
    client->timeout_us = timeout_ms * 1000U;
    if (client->timeout_us == 0U)
    {
        client->timeout_us = 1000U;
    }

    client->write_value = 0U;

    modbus_timing_update(&client->timing, client->config.baudrate);
    modbus_timing_reset(&client->timing);
    modbus_rtu_client_prepare_for_request(client);
    return true;
}

bool modbus_rtu_client_start_write_single(modbus_rtu_client_t *client,
                                          uint8_t slave_address,
                                          uint16_t register_address,
                                          uint16_t value,
                                          uint32_t timeout_ms)
{
    if (client == NULL)
    {
        return false;
    }

    if ((client->state == MODBUS_RTU_CLIENT_STATE_WAITING) || (client->config.tx_handler == NULL))
    {
        return false;
    }

    uint8_t frame[MODBUS_RTU_MAX_ADU_LENGTH];
    frame[0] = slave_address;
    frame[1] = MODBUS_RTU_FUNCTION_WRITE_SINGLE;
    frame[2] = (uint8_t)((register_address >> 8) & 0xFFU);
    frame[3] = (uint8_t)(register_address & 0xFFU);
    frame[4] = (uint8_t)((value >> 8) & 0xFFU);
    frame[5] = (uint8_t)(value & 0xFFU);

    if (!modbus_rtu_client_send_frame(client, frame, 6U))
    {
        return false;
    }

    client->slave_address = slave_address;
    client->function_code = MODBUS_RTU_FUNCTION_WRITE_SINGLE;
    client->start_address = register_address;
    client->quantity = 1U;
    client->write_value = value;
    client->timeout_us = timeout_ms * 1000U;
    if (client->timeout_us == 0U)
    {
        client->timeout_us = 1000U;
    }

    modbus_timing_update(&client->timing, client->config.baudrate);
    modbus_timing_reset(&client->timing);
    modbus_rtu_client_prepare_for_request(client);
    return true;
}

bool modbus_rtu_client_start_write_single_coil(modbus_rtu_client_t *client,
                                               uint8_t slave_address,
                                               uint16_t coil_address,
                                               uint16_t on_off_value,
                                               uint32_t timeout_ms)
{
    if (client == NULL)
    {
        return false;
    }

    if ((client->state == MODBUS_RTU_CLIENT_STATE_WAITING) || (client->config.tx_handler == NULL))
    {
        return false;
    }

    uint8_t frame[MODBUS_RTU_MAX_ADU_LENGTH];
    frame[0] = slave_address;
    frame[1] = MODBUS_RTU_FUNCTION_WRITE_SINGLE_COIL;
    frame[2] = (uint8_t)((coil_address >> 8) & 0xFFU);
    frame[3] = (uint8_t)(coil_address & 0xFFU);
    frame[4] = (uint8_t)((on_off_value >> 8) & 0xFFU);
    frame[5] = (uint8_t)(on_off_value & 0xFFU);

    if (!modbus_rtu_client_send_frame(client, frame, 6U))
    {
        return false;
    }

    client->slave_address = slave_address;
    client->function_code = MODBUS_RTU_FUNCTION_WRITE_SINGLE_COIL;
    client->start_address = coil_address;
    client->quantity = 1U;
    client->write_value = on_off_value;
    client->timeout_us = timeout_ms * 1000U;
    if (client->timeout_us == 0U)
    {
        client->timeout_us = 1000U;
    }

    modbus_timing_update(&client->timing, client->config.baudrate);
    modbus_timing_reset(&client->timing);
    modbus_rtu_client_prepare_for_request(client);
    return true;
}

bool modbus_rtu_client_start_write_multiple(modbus_rtu_client_t *client,
                                            uint8_t slave_address,
                                            uint16_t start_address,
                                            uint16_t quantity,
                                            const uint16_t *values,
                                            uint32_t timeout_ms)
{
    if ((client == NULL) || (values == NULL) || (quantity == 0U) || (quantity > MODBUS_RTU_CLIENT_MAX_WRITE_MULTIPLE_REGISTERS))
    {
        return false;
    }

    if ((client->state == MODBUS_RTU_CLIENT_STATE_WAITING) || (client->config.tx_handler == NULL))
    {
        return false;
    }

    uint16_t byte_count = (uint16_t)(quantity * 2U);
    uint16_t payload_length = (uint16_t)(7U + byte_count);
    if ((payload_length + 2U) > MODBUS_RTU_MAX_ADU_LENGTH)
    {
        return false;
    }

    uint8_t frame[MODBUS_RTU_MAX_ADU_LENGTH];
    frame[0] = slave_address;
    frame[1] = MODBUS_RTU_FUNCTION_WRITE_MULTIPLE;
    frame[2] = (uint8_t)((start_address >> 8) & 0xFFU);
    frame[3] = (uint8_t)(start_address & 0xFFU);
    frame[4] = (uint8_t)((quantity >> 8) & 0xFFU);
    frame[5] = (uint8_t)(quantity & 0xFFU);
    frame[6] = (uint8_t)byte_count;

    for (uint16_t i = 0U; i < quantity; ++i)
    {
        uint16_t value = values[i];
        frame[7U + (uint16_t)(i * 2U)] = (uint8_t)((value >> 8) & 0xFFU);
        frame[8U + (uint16_t)(i * 2U)] = (uint8_t)(value & 0xFFU);
    }

    if (!modbus_rtu_client_send_frame(client, frame, payload_length))
    {
        return false;
    }

    client->slave_address = slave_address;
    client->function_code = MODBUS_RTU_FUNCTION_WRITE_MULTIPLE;
    client->start_address = start_address;
    client->quantity = quantity;
    client->write_value = 0U;
    client->timeout_us = timeout_ms * 1000U;
    if (client->timeout_us == 0U)
    {
        client->timeout_us = 1000U;
    }

    modbus_timing_update(&client->timing, client->config.baudrate);
    modbus_timing_reset(&client->timing);
    modbus_rtu_client_prepare_for_request(client);
    return true;
}

bool modbus_rtu_client_start_write_multiple_coils(modbus_rtu_client_t *client,
                                                  uint8_t slave_address,
                                                  uint16_t start_address,
                                                  uint16_t quantity,
                                                  const uint8_t *coil_bytes,
                                                  uint8_t byte_count,
                                                  uint32_t timeout_ms)
{
    if ((client == NULL) || (coil_bytes == NULL) || (quantity == 0U) || (byte_count == 0U))
    {
        return false;
    }

    if ((client->state == MODBUS_RTU_CLIENT_STATE_WAITING) || (client->config.tx_handler == NULL))
    {
        return false;
    }

