wright0418/Richlink_Smart_Box-M482S-/SampleCode/Smart_Box/modbus_rtu/modbus_rtu_client.c
    uint16_t payload_length = (uint16_t)(7U + byte_count);
    if ((payload_length + 2U) > MODBUS_RTU_MAX_ADU_LENGTH)
    {
        return false;
    }

    uint8_t frame[MODBUS_RTU_MAX_ADU_LENGTH];
    frame[0] = slave_address;
    frame[1] = MODBUS_RTU_FUNCTION_WRITE_MULTIPLE_COILS;
    frame[2] = (uint8_t)((start_address >> 8) & 0xFFU);
    frame[3] = (uint8_t)(start_address & 0xFFU);
    frame[4] = (uint8_t)((quantity >> 8) & 0xFFU);
    frame[5] = (uint8_t)(quantity & 0xFFU);
    frame[6] = byte_count;

    for (uint16_t i = 0U; i < byte_count; ++i)
    {
        frame[7U + i] = coil_bytes[i];
    }

    if (!modbus_rtu_client_send_frame(client, frame, payload_length))
    {
        return false;
    }

    client->slave_address = slave_address;
    client->function_code = MODBUS_RTU_FUNCTION_WRITE_MULTIPLE_COILS;
    client->start_address = start_address;
    client->quantity = quantity;
    client->write_value = 0U;
    client->timeout_us = timeout_ms * 1000U;
    if (client->timeout_us == 0U)
    {
        client->timeout_us = 1000U;
    }

    modbus_timing_update(&client->timing, client->config.baudrate);
    modbus_timing_reset(&client->timing);
    modbus_rtu_client_prepare_for_request(client);
    return true;
}

bool modbus_rtu_client_start_raw(modbus_rtu_client_t *client,
                                 const uint8_t *request_frame,
                                 uint16_t frame_length,
                                 uint32_t timeout_ms)
{
    if ((client == NULL) || (request_frame == NULL) || (frame_length < 4U))
    {
        return false;
    }

    if ((client->state == MODBUS_RTU_CLIENT_STATE_WAITING) || (client->config.tx_handler == NULL))
    {
        return false;
    }

    // Extract slave address and function code from raw frame (without CRC)
    uint8_t slave_address = request_frame[0];
    uint8_t function_code = request_frame[1];

    // Send raw frame directly (already includes CRC)
    if (!client->config.tx_handler(request_frame, frame_length, client->config.tx_context))
    {
        return false;
    }

    client->slave_address = slave_address;
    client->function_code = function_code;
    client->start_address = 0U;
    client->quantity = 0U;
    client->write_value = 0U;
    client->timeout_us = timeout_ms * 1000U;
    if (client->timeout_us == 0U)
    {
        client->timeout_us = 1000U;
    }

    modbus_timing_update(&client->timing, client->config.baudrate);
    modbus_timing_reset(&client->timing);
    modbus_rtu_client_prepare_for_request(client);
    return true;
}

static void modbus_rtu_client_finish_success(modbus_rtu_client_t *client)
{
    client->state = MODBUS_RTU_CLIENT_STATE_COMPLETE;
}

static void modbus_rtu_client_finish_error(modbus_rtu_client_t *client, modbus_rtu_client_state_t error_state)
{
    client->state = error_state;
    led_flash_yellow(2); // 發生 error 時黃燈閃兩下
    led_pulse_red(1000); // 紅燈亮 1000ms
}

static void modbus_rtu_client_finish_exception(modbus_rtu_client_t *client, modbus_exception_t exception)
{
    client->exception_code = exception;
    client->state = MODBUS_RTU_CLIENT_STATE_EXCEPTION;
    led_flash_yellow(2); // 發生 exception 時黃燈閃兩下
    led_pulse_red(1000); // 紅燈亮 1000ms
}

void modbus_rtu_client_handle_rx_byte(modbus_rtu_client_t *client, uint8_t byte, uint32_t timestamp_us)
{
    if ((client == NULL) || (client->state != MODBUS_RTU_CLIENT_STATE_WAITING))
    {
        return;
    }

    if (client->response_length > 0U)
    {
        if (modbus_timing_has_frame_gap(&client->timing, timestamp_us))
        {
            client->response_length = 0U;
            client->expected_length = 0U;
        }
    }

    if (client->response_length >= MODBUS_RTU_MAX_ADU_LENGTH)
    {
        modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_ERROR);
        return;
    }

    if ((client->response_length == 0U) && (byte != client->slave_address))
    {
        return;
    }

    client->response_buffer[client->response_length++] = byte;
    modbus_timing_mark_rx(&client->timing, timestamp_us);

    if (client->response_length == 1U)
    {
        return;
    }

    if (client->response_length == 2U)
    {
        uint8_t function_field = client->response_buffer[1];
        if ((function_field != client->function_code) && (function_field != (uint8_t)(client->function_code | MODBUS_EXCEPTION_FUNCTION_FLAG)))
        {
            modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_ERROR);
            return;
        }

        if ((function_field & MODBUS_EXCEPTION_FUNCTION_FLAG) != 0U)
        {
            client->expected_length = 5U;
        }
        else
        {
            if ((client->function_code == MODBUS_RTU_FUNCTION_WRITE_SINGLE) ||
                (client->function_code == MODBUS_RTU_FUNCTION_WRITE_MULTIPLE) ||
                (client->function_code == MODBUS_RTU_FUNCTION_WRITE_SINGLE_COIL) ||
                (client->function_code == MODBUS_RTU_FUNCTION_WRITE_MULTIPLE_COILS))
            {
                client->expected_length = 8U;
            }
        }
        return;
    }

    if ((client->expected_length == 0U) && (client->response_length >= 3U))
    {
        uint8_t function_field = client->response_buffer[1];
        if ((function_field & MODBUS_EXCEPTION_FUNCTION_FLAG) != 0U)
        {
            client->expected_length = 5U;
        }
        else if ((client->function_code == MODBUS_RTU_FUNCTION_READ_HOLDING) || (client->function_code == MODBUS_RTU_FUNCTION_READ_INPUT))
        {
            uint8_t byte_count = client->response_buffer[2];
            uint16_t expected_data_bytes = (uint16_t)(client->quantity * 2U);
            if (byte_count != expected_data_bytes)
            {
                modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_ERROR);
                return;
            }
            client->expected_length = (uint16_t)(3U + byte_count + 2U);
        }
        else if ((client->function_code == MODBUS_RTU_FUNCTION_READ_COILS) || (client->function_code == MODBUS_RTU_FUNCTION_READ_DISCRETE_INPUTS))
        {
            uint8_t byte_count = client->response_buffer[2];
            uint16_t expected_data_bytes = (uint16_t)((client->quantity + 7U) / 8U);
            if (byte_count != expected_data_bytes)
            {
                modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_ERROR);
                return;
            }
            client->expected_length = (uint16_t)(3U + byte_count + 2U);
        }
        else
        {
            // Raw mode: unknown function code, use byte count if available
            // Assume response format: slave + func + byte_count + data[N] + CRC
            // This works for most read-type functions
            if (client->response_length >= 3U)
            {
                uint8_t byte_count = client->response_buffer[2];
                // Sanity check: byte_count should be reasonable (1-250)
                if (byte_count > 0U && byte_count <= 250U)
                {
                    client->expected_length = (uint16_t)(3U + byte_count + 2U);
                }
            }
        }
    }

