wright0418/Richlink_Smart_Box-M482S-/SampleCode/Smart_Box/modbus_rtu/modbus_rtu_client.c
    if ((client->expected_length != 0U) && (client->response_length == client->expected_length))
    {
        if (!modbus_crc16_validate_frame(client->response_buffer, client->response_length, client->config.crc_method))
        {
            modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_ERROR);
            return;
        }

        uint8_t function_field = client->response_buffer[1];
        if ((function_field & MODBUS_EXCEPTION_FUNCTION_FLAG) != 0U)
        {
            modbus_exception_t exception = (modbus_exception_t)client->response_buffer[2];
            modbus_rtu_client_finish_exception(client, exception);
        }
        else
        {
            if (function_field == MODBUS_RTU_FUNCTION_WRITE_SINGLE)
            {
                uint16_t resp_address = modbus_rtu_protocol_read_u16(&client->response_buffer[2]);
                uint16_t resp_value = modbus_rtu_protocol_read_u16(&client->response_buffer[4]);
                if ((resp_address != client->start_address) || (resp_value != client->write_value))
                {
                    modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_ERROR);
                    return;
                }
            }
            else if (function_field == MODBUS_RTU_FUNCTION_WRITE_MULTIPLE)
            {
                uint16_t resp_address = modbus_rtu_protocol_read_u16(&client->response_buffer[2]);
                uint16_t resp_quantity = modbus_rtu_protocol_read_u16(&client->response_buffer[4]);
                if ((resp_address != client->start_address) || (resp_quantity != client->quantity))
                {
                    modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_ERROR);
                    return;
                }
            }
            else if (function_field == MODBUS_RTU_FUNCTION_WRITE_SINGLE_COIL)
            {
                uint16_t resp_address = modbus_rtu_protocol_read_u16(&client->response_buffer[2]);
                uint16_t resp_value = modbus_rtu_protocol_read_u16(&client->response_buffer[4]);
                if ((resp_address != client->start_address) || (resp_value != client->write_value))
                {
                    modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_ERROR);
                    return;
                }
            }
            else if (function_field == MODBUS_RTU_FUNCTION_WRITE_MULTIPLE_COILS)
            {
                uint16_t resp_address = modbus_rtu_protocol_read_u16(&client->response_buffer[2]);
                uint16_t resp_quantity = modbus_rtu_protocol_read_u16(&client->response_buffer[4]);
                if ((resp_address != client->start_address) || (resp_quantity != client->quantity))
                {
                    modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_ERROR);
                    return;
                }
            }
            modbus_rtu_client_finish_success(client);
        }
    }
}

void modbus_rtu_client_poll(modbus_rtu_client_t *client, uint32_t timestamp_us)
{
    if ((client == NULL) || (client->state != MODBUS_RTU_CLIENT_STATE_WAITING))
    {
        return;
    }

    if ((client->timeout_us > 0U) && ((timestamp_us - client->request_timestamp_us) >= client->timeout_us))
    {
        modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_TIMEOUT);
        return;
    }

    if ((client->response_length > 0U) && modbus_timing_has_frame_gap(&client->timing, timestamp_us))
    {
        modbus_rtu_client_finish_error(client, MODBUS_RTU_CLIENT_STATE_TIMEOUT);
    }
}

bool modbus_rtu_client_is_busy(const modbus_rtu_client_t *client)
{
    if (client == NULL)
    {
        return false;
    }

    // 保護臨界區，防止中斷修改狀態
    uint32_t primask = __get_PRIMASK();
    __disable_irq();

    bool is_busy = (client->state == MODBUS_RTU_CLIENT_STATE_WAITING);

    __set_PRIMASK(primask);

    return is_busy;
}

modbus_rtu_client_state_t modbus_rtu_client_get_state(const modbus_rtu_client_t *client)
{
    if (client == NULL)
    {
        return MODBUS_RTU_CLIENT_STATE_ERROR;
    }

    // 保護臨界區，防止中斷修改狀態
    uint32_t primask = __get_PRIMASK();
    __disable_irq();

    modbus_rtu_client_state_t state = client->state;

    __set_PRIMASK(primask);

    return state;
}

uint16_t modbus_rtu_client_get_quantity(const modbus_rtu_client_t *client)
{
    if ((client == NULL) || (client->state != MODBUS_RTU_CLIENT_STATE_COMPLETE))
    {
        return 0U;
    }
    return client->quantity;
}

modbus_exception_t modbus_rtu_client_get_exception(const modbus_rtu_client_t *client)
{
    if (client == NULL)
    {
        return MODBUS_EXCEPTION_SERVER_DEVICE_FAILURE;
    }
    return client->exception_code;
}

void modbus_rtu_client_copy_response(const modbus_rtu_client_t *client, uint16_t *destination, uint16_t max_registers)
{
    if ((client == NULL) || (destination == NULL) || (client->state != MODBUS_RTU_CLIENT_STATE_COMPLETE))
    {
        return;
    }

    if ((client->function_code != MODBUS_RTU_FUNCTION_READ_HOLDING) && (client->function_code != MODBUS_RTU_FUNCTION_READ_INPUT))
    {
        return;
    }

    uint16_t quantity = client->quantity;
    if (quantity > max_registers)
    {
        quantity = max_registers;
    }

    const uint8_t *data_ptr = &client->response_buffer[3];
    for (uint16_t i = 0U; i < quantity; ++i)
    {
        destination[i] = modbus_rtu_protocol_read_u16(&data_ptr[i * 2U]);
    }
}

const uint8_t *modbus_rtu_client_get_raw_response(const modbus_rtu_client_t *client, uint16_t *length)
{
    if ((client == NULL) || (length == NULL))
    {
        return NULL;
    }

    *length = client->response_length;
    return client->response_buffer;
}

void modbus_rtu_client_clear(modbus_rtu_client_t *client)
{
    if (client == NULL)
    {
        return;
    }

    client->state = MODBUS_RTU_CLIENT_STATE_IDLE;
    client->response_length = 0U;
    client->expected_length = 0U;
    client->exception_code = MODBUS_EXCEPTION_NONE;
    client->write_value = 0U;
    modbus_timing_reset(&client->timing);
}
